import random
import time

bukvi = 0
batl = 0
slovo = ''
izvestnie = ['_']
c = ''
pobedil = 0
ochko = 0
isp = [''] * 33
ochki = 0
bukva = ''
chislo = 0
igroki = 1
isp = [' ']
ocherd = 0
ocherd2 = 0
win_phrases = ['']
ail_phrases = [
    "Увы, но это неверное слово!",
    "Ой, какая досада! Вы не угадали...",
    "Нет, к сожалению, это не оно!",
    "Барабан крутится, а слово — мимо!",
    "Не повезло... Попробуйте ещё раз!",
    "Холодно! Совсем не то слово!",
    "Жаль, но загаданное слово — другое...",
    "Вы близко, но это не победа!",
    "Эх, сегодня удача не на вашей стороне!",
    "Неправильно! Слово остаётся загадкой..."
]
wrong_letter_phrases = [
    "Увы, такой буквы нет!",
    "Ой-ой, этой буквы в слове не оказалось...",
    "Нет-нет, вы ошиблись буквой!",
    "Барабан крутится, а буква — мимо!",
    "Холодно! Этой буквы здесь нет!",
    f"Жаль, но в слове нет буквы {bukva}...",
    "Эх, пусто! Попробуйте другую букву!",
    f"Не угадали! Буква {bukva} не подошла.",
    "Фальстарт! Такой буквы в загадке нет.",
    "Мимо! Слово остаётся загадкой..."
]
fail_phrases = [
            "Увы, но это неверное слово!",
            "Ой, какая досада! Вы не угадали...",
            "Нет, к сожалению, это не оно!",
            "Барабан крутится, а слово — мимо!",
            "Не повезло... Попробуйте ещё раз!",
            "Холодно! Совсем не то слово!",
            "Жаль, но загаданное слово — другое...",
            "Вы близко, но это не победа!",
            "Эх, сегодня удача не на вашей стороне!",
            "Неправильно! Слово остаётся загадкой..."
        ]
right_letter_phrases = [
    f"Есть такая буква! Открываем «{bukva}»!",
    f"Абсолютно верно! Буква «{bukva}» на месте!",
    f"Опа-на! Буква «{bukva}» принесла вам удачу!",
    f"Барабан ликует! Буква «{bukva}» в слове есть!",
    f"Да-да-да! Вот она — буква «{bukva}»!",
    f"Прямо в яблочко! Открывайте все «{bukva}»!",
    f"Великолепно! Буква «{bukva}» теперь на табло!",
    f"Так держать! Буква «{bukva}» — ваша!",
    f"Словно по волшебству! «{bukva}» на месте!",
    f"Игра пошла! Буква «{bukva}» открыта!"
]  # Фразы
win_by_letters_phrases = [
    f"Вы собрали слово «{c}» по буквам! Поздравляем с победой!",
    f"Постепенно открывая буквы, вы верно составили слово «{c}».",
    f"Шаг за шагом вы пришли к правильному ответу - «{c}».",
    f"Методом исключения и подбора вы раскрыли слово «{c}».",
    f"Буква за буквой - и вот перед нами правильное слово «{c}».",
    f"Вы проявили терпение и собрали слово «{c}» целиком.",
    f"Анализируя каждую букву, вы вычислили загаданное слово - «{c}».",  # Фразы
    f"Ваша тактика угадывания букв привела вас к слову «{c}».",
    f"Открывая по одной букве, вы полностью восстановили слово «{c}».",
    f"Постепенно заполняя пробелы, вы составили слово «{c}»."
]
points_phrases1 = [
    f"Вы получаете {ochko} очков",
    f"На ваш счет начислено {ochko} очков",
    f"Ваш выигрыш в этом раунде - {ochko} очков",
    f"Барабан принес вам {ochko} очков",
    f"К вашей сумме добавлено {ochko} очков",
    f"Вы заработали {ochko} очков в этом ходе",
    f"Поздравляем с выигрышем {ochko} очков",
    f"Ваш приз - {ochko} очков",
    f"Текущий выигрыш составляет {ochko + ochki} очков",
    f"В выигрыш добавлено: {ochko} очков"
]
slova = [
            "автомобиль", "аэропорт", "банан", "балкон", "библиотека", "брат", "бумага", "ваза", "ветер", "вино",
            "гараж", "глаз", "город", "гора", "гриб", "дверь", "дерево", "дождь", "дом", "дорога",
            "еда", "железо", "животное", "завод", "задача", "звезда", "земля", "игра", "идея", "институт",
            "камень", "книга", "компьютер", "корабль", "кошка", "кровать", "лампа", "лес", "лист", "ложка",
            "магазин", "мебель", "молоко", "море", "музыка", "нож", "нос", "облако", "огонь", "одежда",
            "окно", "олень", "остров", "отец", "парк", "песок", "письмо", "платье", "поле", "помощь",
            "посуда", "птица", "работа", "радио", "река", "рисунок", "рыба", "самолет", "свет", "собака",
            "солнце", "стол", "стул", "тарелка", "телефон", "телевизор", "тетрадь", "трава", "улица", "учитель",
            "фонарь", "фрукт", "цветок", "часы", "человек", "школа", "экран", "яблоко", "ящик", "январь",
            "апрель", "август", "алмаз", "ангел", "апельсин", "арбуз", "атлас", "багаж", "бассейн", "бегун",
            "бензин", "берег", "билет", "бокал", "болото", "борщ", "букет", "буря", "бык", "вагон",
            "ведро", "велосипед", "верблюд", "весна", "ветка", "вишня", "вода", "воздух", "волк", "воробей",
            "врач", "время", "высота", "газета", "гвоздь", "герой", "гитара", "голова", "гость", "градусник",
            "грипп", "груша", "гусь", "дворец", "декабрь", "деньги", "диван", "доктор", "дракон", "дуб",
            "дыня", "евро", "ежевика", "жара", "жираф", "жук", "забор", "замок", "запах", "звезда",
            "зебра", "зима", "золото", "игла", "июль", "июнь", "кабинет", "календарь", "камень", "картина",
            "кастрюля", "кенгуру", "кино", "класс", "клубника", "книга", "ковер", "кольцо", "конец", "корова",
            "костюм", "кот", "кресло", "кровь", "крыша", "курица", "лампочка", "лекарство", "лимон", "линия",
            "лось", "луна", "лыжи", "львенок", "люстра", "май", "малина", "март", "масло", "медведь",
            "метро", "минута", "молния", "морковь", "мост", "муравей", "мыло", "мышь", "мяч", "ноябрь",
            "носок", "ночь", "обед", "облако", "овца", "огурец", "океан", "олень", "опера", "орел",
            "осень", "осьминог", "открытка", "пакет", "палец", "памятник", "паук", "песня", "пианино", "пирог",
            "платок", "плед", "площадь", "победа", "подъезд", "поезд", "попугай", "портрет", "посылка", "поцелуй",
            "президент", "приз", "пруд", "пушка", "пыль", "радуга", "ракета", "рамка", "ребенок", "ресторан",
            "рис", "роза", "рубашка", "ручей", "рюкзак", "салат", "сапог", "свеча", "свитер", "секрет",
            "семья", "сердце", "сирень", "сказка", "слон", "снег", "сова", "сок", "солнце", "сорока",
            "спичка", "стакан", "стул", "сумка", "суп", "сыр", "такси", "танк", "театр", "тетрадь",
            "тигр", "топор", "торт", "тротуар", "труба", "туча", "тыква", "ужин", "указка", "улитка",
            "февраль", "фильм", "фонтан", "фото", "халат", "хлеб", "холодильник", "цвет", "чай", "чеснок",
            "шапка", "шарф", "шея", "школа", "шоколад", "штора", "щука", "этаж", "юбка", "ягода",
            "яйцо", "якорь", "янтарь", "абажур", "абрикос", "авангард", "автобус", "агент", "адрес", "ажиотаж",
            "азбука", "айсберг", "аквариум", "аккорд", "актер", "аллея", "альбом", "ампула", "анкета", "анонс",
            "антибиотик", "аппарат", "арена", "артист", "ассорти", "атака", "афиша", "аэродром", "багажник",
            "бадминтон",
            "баклажан", "балет", "банк", "барабан", "барьер", "бассейн", "батон", "баян", "бегемот", "безопасность",
            "беседа", "библиотека", "бизнес", "бинокль", "бисер", "благодарность", "блеск", "блин", "блокнот", "бобер",
            "богатство", "боевик", "бой", "бокал", "болт", "борода", "ботинок", "браслет", "бревно", "бриллиант",
            "бровь", "брусника", "будущее", "букварь", "бульвар", "бумажник", "бургер", "бутон", "быстрота", "вагончик",
            "валенок", "ванна", "варенье", "вафля", "вдохновение", "веер", "век", "велосипед", "венок", "верность",
            "вес", "ветка", "вечер", "взаимодействие", "взгляд", "вибрация", "видео", "вилка", "виноград", "витрина",
            "вкус", "влияние", "внешность", "вода", "воздействие", "войлок", "волна", "ворон", "восторг", "впечатление",
            "вращение", "время", "встреча", "вторник", "вулкан", "выбор", "вывод", "высота", "выставка", "вязание",
            "гавань", "газ", "галерея", "гантель", "гардероб", "гастроном", "гвоздика", "гель", "гербарий", "гид",
            "гимнастика", "глазок", "глобус", "глубина", "гнездо", "говядина", "год", "голос", "гора", "гордость",
            "горизонт", "горшок", "гостиница", "гравий", "гриль", "гром", "грунт", "грусть", "губка", "даль",
            "дамба", "данные", "дар", "датчик", "дверца", "двигатель", "дворец", "дебют", "девушка", "декада",
            "декор", "дело", "демонстрация", "деревня", "держатель", "десерт", "деталь", "джинсы", "диаметр", "диван",
            "диета", "дизайн", "динозавр", "диплом", "диск", "дистанция", "доброта", "документ", "долг", "домен",
            "донор", "доска", "доход", "драгоценность", "дрель", "дрожжи", "дружба", "дума", "дупло", "духи",
            "душа", "дым", "дыня", "дыхание", "евро", "ежедневник", "емкость", "жакет", "жалюзи", "жар",
            "жгут", "желание", "жемчуг", "жеребец", "жест", "живот", "жизнь", "журнал", "забава", "забор",
            "заведение", "загадка", "задача", "зажим", "заказ", "закон", "замок", "запах", "запись", "зарплата",
            "затвор", "защита", "звезда", "звонок", "здание", "здоровье", "зебра", "земля", "зеркало", "зима",
            "знак", "знание", "золото", "зона", "зоопарк", "зуб", "игла", "идея", "издание", "измерение",
            "изображение", "икра", "иллюстрация", "имя", "индекс", "инструмент", "интерес", "интернет", "информация",
            "ирис",
            "искра", "исполнение", "история", "июль", "июнь", "кабинет", "кавычка", "кадр", "казарма", "кайф",
            "календарь", "камень", "канал", "капитал", "капля", "карандаш", "карта", "каска", "кастрюля", "катер",
            "кафе", "качели", "квартира", "кепка", "километр", "кино", "кисть", "клавиша", "клетка", "клиент",
            "клоун", "клуб", "ключ", "книга", "ковер", "код", "кожа", "койка", "коктейль", "колбаса",
            "колесо", "коллекция", "кольцо", "команда", "комедия", "комната", "компьютер", "конверт", "конкурс",
            "контакт",
            "концерт", "корень", "коридор", "коробка", "корпус", "корзина", "король", "костюм", "котел", "кофе",
            "край", "кран", "краска", "кресло", "кровь", "кролик", "круг", "крыло", "крючок", "кубик",
            "кузов", "кукла", "кулон", "кумир", "купол", "курица", "куст", "лаборатория", "лава", "лагерь",
            "ладонь", "лазер", "лак", "лампа", "ланч", "лапа", "ларек", "ластик", "легенда", "лед",
            "лейка", "лента", "лес", "лето", "лечение", "лидер", "лимон", "линия", "лист", "лифт",
            "лоб", "лодка", "лоза", "лопата", "лось", "лужа", "лук", "луна", "лыжи", "любовь",
            "люстра", "магазин", "майка", "максимум", "малыш", "мама", "мандарин", "марафон", "марка", "масло",
            "математика", "машина", "мебель", "медаль", "мел", "мембрана", "меню", "мера", "место", "металл",
            "метеорит", "мех", "мечта", "микрофон", "минута", "мир", "миска", "мода", "мозг", "молния",
            "молоко", "молоток", "момент", "монитор", "море", "мост", "мотылек", "мох", "мощность", "музей",
            "музыка", "мука", "муравей", "мусор", "мысль", "мягкость", "мяч", "набор", "навык", "надежда",
            "название", "наказание", "наклон", "налог", "намерение", "напряжение", "народ", "насос", "настройка",
            "наука",
            "небо", "недостаток", "нежность", "нейлон", "ненависть", "нефть", "низ", "нитка", "новость", "ножницы",
            "номер", "норма", "носок", "нота", "ночь", "ноябрь", "нрав", "нужда", "нырок", "обед",
            "облако", "обмен", "обои", "образ", "обувь", "обучение", "объект", "овес", "огонь", "ограда",
            "одежда", "ожидание", "озеро", "окно", "октябрь", "олень", "операция", "опыт", "орган", "орех",
            "оригинал", "осанка", "осень", "основа", "остаток", "остров", "отдых", "отец", "открытие", "отрасль",
            "офис", "охота", "оценка", "ошибка", "павильон", "пакет", "палец", "память", "панель", "папка",
            "парк", "паром", "паста", "пауза", "паук", "пациент", "певец", "педагог", "пейзаж", "пельмень",
            "пенал", "пепел", "перо", "песок", "петля", "печать", "пианино", "пиво", "пиджак", "пикник",
            "пилот", "пирог", "письмо", "пицца", "плавание", "план", "пластик", "платье", "плечо", "плита",
            "плоскость", "площадь", "победа", "повод", "погода", "подбородок", "поддержка", "подруга", "поезд", "поза",
            "позиция", "поиск", "покой", "пол", "поле", "политика", "полка", "полотно", "полюс", "помещение",
            "помощь", "пони", "попугай", "порог", "порт", "портрет", "порядок", "поселок", "пост", "поцелуй",
            "почва", "пощечина", "поэзия", "пояс", "правило", "премия", "препарат", "прибор", "привычка", "признак",
            "пример", "природа", "прическа", "проблема", "прогноз", "продукт", "проект", "проза", "пропасть",
            "проспект",
            "противник", "процесс", "прыжок", "птица", "публика", "пуговица", "пудра", "пузырь", "пульт", "пустыня",
            "путь", "пыль", "пьеса", "пятно", "работа", "равнина", "радио", "радость", "размер", "ракета",
            "рамка", "рань", "растение", "раунд", "реакция", "ребенок", "революция", "регион", "режим", "результат",
            "река", "религия", "ремонт", "ресторан", "речь", "рисунок", "робот", "родина", "роза", "рок",
            "роман", "рот", "рубашка", "рубеж", "рука", "руль", "ручка", "рыба", "рынок", "рюкзак",
            "сабля", "сад", "салат", "самолет", "санки", "сапог", "сарай", "сахар", "свеча", "свитер",
            "свобода", "связь", "сдача", "север", "сезон", "секрет", "семья", "сентябрь", "сердце", "серия",
            "сигарета", "сиденье", "сила", "символ", "система", "ситуация", "сказка", "скамья", "склад", "скорость",
            "слава", "слеза", "слива", "слово", "слой", "смена", "смех", "смола", "смысл", "снег",
            "собака", "совет", "сок", "солдат", "солнце", "сон", "сорт", "состав", "сотня", "соус",
            "социум", "союз", "спальня", "спектакль", "спина", "список", "спорт", "справа", "средство", "стакан",
            "статус", "ствол", "стекло", "стена", "стиль", "стоимость", "стол", "сторона", "страна", "стрела",
            "строй", "стул", "суббота", "сувенир", "сумка", "суп", "суть", "сухожилие", "сцена", "счастье",
            "счет", "сын", "таблица", "талант", "танец", "тарелка", "творог", "театр", "текст", "телефон",
            "тело", "тема", "темп", "теннис", "тепло", "термин", "тетрадь", "техника", "тигр", "тип",
            "тишина", "ткань", "товар", "толпа", "тон", "топливо", "торт", "точка", "трава", "традиция",
            "транспорт", "тревога", "тренировка", "трибуна", "тропа", "труба", "тряпка", "туман", "туфля", "тыква",
            "тюльпан", "убеждение", "уборка", "уважение", "угол", "удар", "удовольствие", "ужин", "узник", "указатель",
            "укол", "улыбка", "университет", "упаковка", "урна", "урок", "услуга", "успех", "устав", "устройство",
            "утро", "ухо", "учеба", "ущерб", "факт", "фамилия", "фантазия", "фартук", "февраль", "фестиваль",
            "фигура", "фильм", "финал", "фирма", "флаг", "флейта", "флот", "фокус", "фон", "форма",
            "фото", "фраза", "фрукт", "фундамент", "футбол", "халат", "характер", "хвост", "хлеб", "хобби",
            "холст", "хор", "хозяин", "холодильник", "художник", "цвет", "цель", "цемент", "центр", "цепь",
            "час", "чаша", "человек", "чемодан", "череп", "черта", "честь", "число", "шанс", "шапка",
            "шарф", "шахта", "шея", "шина", "шкаф", "школа", "шнур", "шоколад", "штора", "шум",
            "шутка", "щека", "этаж", "этап", "эхо", "юбка", "юмор", "яблоко", "ягода", "язык",
            "яйцо", "январь", "яркость", "ясень", "ящик"
                                                  "год", "человек", "время", "дело", "жизнь", "день", "рука", "работа",
            "слово", "место",
            "вопрос", "лицо", "глаз", "страна", "друг", "сторона", "дом", "случай", "ребенок", "голова",
            "система", "вид", "конец", "отношение", "город", "часть", "женщина", "проблема", "земля", "решение",
            "власть", "машина", "закон", "час", "образ", "отец", "история", "нога", "вода", "война",
            "возможность", "компания", "результат", "дверь", "бог", "народ", "область", "число", "голос", "развитие",
            "группа", "жена", "процесс", "условие", "книга", "ночь", "суд", "деньга", "уровень", "начало",
            "государство", "стол", "средство", "связь", "имя", "президент", "форма", "путь", "организация", "качество",
            "действие", "статья", "общество", "ситуация", "деятельность", "школа", "душа", "дорога", "язык", "взгляд",
            "момент", "минута", "месяц", "порядок", "цель", "программа", "муж", "помощь", "мысль", "вечер",
            "орган", "правительство", "рынок", "предприятие", "партия", "роль", "смысл", "мама", "мера", "улица",
            "состояние", "задача", "информация", "театр", "внимание", "производство", "квартира", "труд", "тело",
            "письмо",
            "центр", "утро", "мать", "комната", "семья", "сын", "смерть", "положение", "интерес", "федерация",
            "век", "идея", "управление", "автор", "окно", "ответ", "совет", "разговор", "мужчина", "ряд",
            "счет", "мнение", "цена", "точка", "план", "проект", "глава", "материал", "основа", "причина",
            "движение", "культура", "сердце", "рубль", "наука", "документ", "неделя", "вещь", "чувство", "правило",
            "служба", "газета", "срок", "институт", "член", "ход", "стена", "директор", "плечо", "опыт",
            "встреча", "принцип", "событие", "структура", "количество", "товарищ", "создание", "значение", "объект",
            "гражданин",
            "очередь", "период", "образование", "состав", "пример", "лес", "исследование", "девушка", "данные", "палец",
            "судьба", "тип", "метод", "политика", "армия", "брат", "представитель", "борьба", "использование", "шаг",
            "игра", "участие", "территория", "край", "размер", "номер", "район", "население", "банк", "начальник",
            "класс", "зал", "изменение", "большинство", "характер", "кровь", "направление", "позиция", "герой",
            "течение",
            "девочка", "искусство", "гость", "воздух", "мальчик", "фильм", "договор", "регион", "выбор", "свобода",
            "врач", "экономика", "небо", "факт", "церковь", "завод", "фирма", "бизнес", "союз", "деньги",
            "специалист", "род", "команда", "руководитель", "спина", "дух", "музыка", "способ", "хозяин", "поле",
            "доллар", "память", "природа", "дерево", "оценка", "объем", "картина", "процент", "требование", "писатель",
            "сцена", "анализ", "основание", "повод", "вариант", "берег", "модель", "степень", "самолет", "телефон",
            "граница", "песня", "половина", "министр", "угол", "зрение", "предмет", "литература", "операция", "двор",
            "спектакль", "руководство", "солнце", "автомобиль", "родитель", "участник", "журнал", "база",
            "пространство", "защита",
            "название", "стих", "ум", "море", "удар", "знание", "солдат", "миллион", "строительство", "технология",
            "председатель", "сон", "сознание", "бумага", "реформа", "оружие", "линия", "текст", "выход", "ребята",
            "магазин", "соответствие", "участок", "услуга", "поэт", "предложение", "желание", "пара", "успех", "среда",
            "возраст", "комплекс", "бюджет", "представление", "площадь", "генерал", "господин", "дочь", "понятие",
            "кабинет",
            "безопасность", "фонд", "сфера", "папа", "сотрудник", "продукция", "будущее", "продукт", "содержание",
            "художник",
            "республика", "сумма", "контроль", "парень", "ветер", "хозяйство", "помочь", "курс", "губа", "река",
            "грудь", "огонь", "нос", "волос", "ухо", "отсутствие", "радость", "сад", "подготовка", "необходимость",
            "доктор", "лето", "камень", "здание", "капитан", "собака", "итог", "рис", "техника", "элемент",
            "источник", "деревня", "депутат", "проведение", "рот", "масса", "комиссия", "цвет", "рассказ", "функция",
            "определение", "мужик", "обеспечение", "обстоятельство", "работник", "разработка", "лист", "звезда", "гора",
            "применение",
            "победа", "товар", "воля", "зона", "предел", "целое", "личность", "офицер", "влияние", "поддержка",
            "ответственность", "цветок", "праздник", "немец", "бой", "сестра", "господь", "учитель", "многое", "рамка",
            "практика", "показатель", "метр", "войско", "частность", "особенность", "снег", "комитет", "налог", "акт",
            "отдел", "карман", "вывод", "норма", "читатель", "этап", "сравнение", "прошлое", "фамилия", "кухня",
            "заявление", "доля", "пункт", "студент", "учет", "впечатление", "доход", "вирус", "клетка", "удовольствие",
            "теория", "враг", "собрание", "бутылка", "расчет", "го", "режим", "множество", "клуб", "попытка",
            "зуб", "сеть", "семь", "министерство", "прием", "боль", "сожаление", "кожа", "субъект", "знак",
            "актер", "ресурс", "акция", "газ", "журналист", "звук", "передача", "здоровье", "администрация", "болезнь",
            "детство", "мастер", "выборы", "зима", "подход", "поиск", "механизм", "выражение", "скорость", "ощущение",
            "стоимость", "коридор", "ошибка", "лидер", "карта", "заседание", "глубина", "хлеб", "поверхность",
            "энергия",
            "нарушение", "реализация", "революция", "поведение", "профессор", "исполнение", "заместитель", "суть",
            "станция", "реакция",
            "десяток", "столица", "формирование", "поколение", "дума", "существование", "продажа", "список",
            "способность", "противник",
            "схема", "долг", "режиссер", "отличие", "колено", "дед", "свойство", "этаж", "секунда", "фактор",
            "житель", "явление", "высота", "сосед", "усилие", "рождение", "расход", "остров", "фигура", "наличие",
            "дядя", "милиция", "растение", "существо", "черт", "бабушка", "законодательство", "собственность",
            "отрасль", "слеза",
            "волна", "стекло", "традиция", "январь", "оборудование", "зависимость", "фраза", "декабрь", "сведение",
            "трубка",
            "сентябрь", "университет", "командир", "храм", "повышение", "стиль", "артист", "больница", "одежда",
            "охрана",
            "водка", "кодекс", "имущество", "птица", "переход", "красота", "клиент", "толпа", "адрес", "отделение",
            "октябрь", "чудо", "счастие", "улыбка", "ужас", "аппарат", "корабль", "родина", "животное", "черта",
            "известие", "понимание", "тень", "апрель", "коллега", "преступление", "рыба", "кресло", "запах", "выставка",
            "князь", "фотография", "весна", "помещение", "эпоха", "занятие", "произведение", "концерт", "ладонь",
            "дама",
            "сомнение", "американец", "середина", "зарплата", "тайна", "запад", "июнь", "беседа", "фронт", "поезд",
            "должность", "баба", "промышленность", "музей", "судья", "получение", "полковник", "зритель", "секретарь",
            "установка",
            "поток", "ценность", "образец", "страница", "перспектива", "трава", "чиновник", "мозг", "сотня", "лагерь",
            "выступление", "оборона", "постановление", "честь", "настроение", "кровать", "характеристика",
            "обязанность", "шея", "крыша",
            "появление", "учреждение", "признак", "труба", "жертва", "беда", "фон", "организм", "ученик", "заключение",
            "выполнение", "канал", "исключение", "дача", "соглашение", "осень", "польза", "стул", "июль", "дождь",
            "сутки", "еврей", "конкурс", "открытие", "телевизор", "лошадь", "температура", "приказ", "лестница",
            "реклама",
            "спор", "подруга", "угроза", "конфликт", "изучение", "вино", "концепция", "достижение", "сообщение",
            "объединение",
            "обстановка", "костюм", "ключ", "ресторан", "назначение", "царь", "воспоминание", "увеличение", "вкус",
            "мероприятие",
            "лоб", "слой", "восток", "последствие", "принятие", "сотрудничество", "нефть", "слух", "бок", "переговоры",
            "тюрьма", "кандидат", "просьба", "реальность", "подарок", "категория", "потребность", "быль", "редакция",
            "очко",
            "километр", "губернатор", "новость", "инструмент", "потеря", "взаимодействие", "звонок", "кусок", "капитал",
            "грех",
            "перевод", "партнер", "ноябрь", "молодежь", "тишина", "творчество", "книжка", "мясо", "масло", "деталь",
            "инженер", "оплата", "эксперт", "кремль", "февраль", "следствие", "пьеса", "билет", "урок", "коллектив",
            "устройство", "палата", "площадка", "опасность", "пропасть", "воздействие", "разница", "родственник",
            "сезон", "издание",
            "человечество", "снижение", "запас", "крик", "публика", "вещество", "экран", "эффект", "ящик", "ракета",
            "водитель", "пакет", "зеркало", "вес", "дно", "вагон", "убийство", "тон", "щека", "дурак",
            "длина", "давление", "двигатель", "камера", "обращение", "формула", "запись", "крыло", "поездка",
            "гостиница",
            "колесо", "разрешение", "торговля", "академия", "доклад", "общение", "присутствие", "процедура",
            "испытание", "нож",
            "проверка", "коммунист", "цифра", "полет", "стакан", "эффективность", "обучение", "портрет", "достоинство",
            "рассмотрение",
            "владелец", "жилье", "компьютер", "корень", "смена", "доказательство", "кадр", "лейтенант", "признание",
            "темнота",
            "пистолет", "наблюдение", "мост", "ремонт", "истина", "вход", "политик", "живот", "кредит", "шум",
            "обед", "недостаток", "памятник", "вершина", "серия", "эксперимент", "сущность", "транспорт", "инициатива",
            "активность",
            "конференция", "кулак", "доска", "ожидание", "платье", "смех", "отказ", "сбор", "пенсия", "буква",
            "порог", "автобус", "воспитание", "производитель", "полоса", "риск", "пиво", "корпус", "штаб", "кольцо",
            "постель", "выпуск", "дворец", "брак", "прокурор", "печать", "окончание", "автомат", "тенденция",
            "следователь",
            "штат", "куст", "старуха", "описание", "психология", "шутка", "съезд", "ставка", "забота", "величина",
            "версия", "мешок", "конструкция", "контакт", "шанс", "лодка", "редактор", "заказ", "кофе", "рубеж",
            "статус", "спорт", "покой", "кризис", "взрыв", "профессия", "дым", "металл", "сапог", "диван",
            "интернет", "почва", "лед", "подразделение", "минимум", "конь", "дружба", "вина", "замок", "мечта",
            "сигнал", "талант", "мгновение", "столик", "затрата", "золото", "миг", "плата", "подъезд", "масштаб",
            "обсуждение", "сделка", "обязательство", "расстояние", "отдых", "телевидение", "тетя", "яблоко",
            "свидетель", "монастырь",
            "чтение", "параметр", "кампания", "помощник", "полк", "мощность", "сюжет", "потолок", "регистрация",
            "майор",
            "эксплуатация", "озеро", "новое", "атмосфера", "премия", "совесть", "предприниматель", "мальчишка", "дочка",
            "приятель",
            "начальство", "препарат", "село", "обработка", "танк", "милиционер", "ручка", "возвращение", "прокуратура",
            "ворота",
            "молоко", "еда", "сказка", "краска", "хвост", "сигарета", "введение", "покупатель", "поворот", "москвич",
            "ограничение", "инвестиция", "нация", "набор", "поселок", "дыхание", "адвокат", "сумка", "пресса",
            "корреспондент",
            "песок", "удивление", "потребитель", "указание", "изображение", "счастье", "мэр", "согласие",
            "действительность", "планета",
            "агентство", "танец", "библиотека", "финансирование", "объяснение", "распределение", "конституция",
            "таблица", "поэзия", "термин",
            "прибыль", "стандарт", "восторг", "гибель", "изделие", "темп", "вооружение", "осуществление", "уход",
            "чемпионат",
            "молитва", "контракт", "философия", "горло", "оборот", "кость", "ведомство", "преимущество", "мина",
            "полномочие"
        ]
superslova = [word for word in slova if len(word) == 5]
sektora = ['Приз', 'Приз', 'х2', 'х2', '+', 'Очки', 'Очки', 'Очки'  , 'Очки', 'Очки', 'Очки', 'Очки', 'Очки', 'Очки', 'Очки', 'Очки', 'Очки', 'Очки', 'Очки', 'Очки', 'Очки', 'Очки','Очки', 'Очки']
sektora2 = ['Приз', 'Приз', 'х2', 'х2', '+', '-→', 'Банкрот', 'Банкрот', 'Очки', 'Очки', 'Очки', 'Очки', 'Очки', 'Очки', 'Очки', 'Очки', 'Очки', 'Очки', 'Очки', 'Очки', 'Очки', 'Очки','Очки', 'Очки']

def nachalo():
    try:
        global ocherd, ocherd2, ochki, igroki, vibili, isp, d, slovo, bukvi, c, batl, izvestnie, win_phrases, ail_phrases, wrong_letter_phrases, right_letter_phrases, win_by_letters_phrases, fail_phrases
        slovo = slova[random.randint(0, 2114)].lower()
        bukvi = len(slovo)
        c = slovo
        batl = 0
        d = 0
        ocherd = 0
        ocherd2 = 0
        isp = [''] * 33
        slovo = list(slovo)
        izvestnie = ['_'] * bukvi
        win_phrases = [
            f"Правильно! Загаданное слово - «{c}»!",
            f"Верный ответ! Это действительно «{c}».",
            f"Поздравляем! Вы угадали слово «{c}».",
            f"Абсолютно верно! Это слово «{c}».",
            f"Так и есть! Перед нами слово «{c}».",
            f"Вы совершенно правы! Загаданное слово - «{c}».",
            f"Браво! Вы разгадали наше слово - «{c}».",
            f"Победа! Вы назвали правильное слово - «{c}».",
            f"Игра окончена! Правильный ответ - «{c}».",
            f"Молодец! Вы нашли нужное слово - «{c}»."
        ]
        fail_phrases = [
            "Увы, но это неверное слово!",
            "Ой, какая досада! Вы не угадали...",
            "Нет, к сожалению, это не оно!",
            "Барабан крутится, а слово — мимо!",
            "Не повезло... Попробуйте ещё раз!",
            "Холодно! Совсем не то слово!",
            "Жаль, но загаданное слово — другое...",
            "Вы близко, но это не победа!",
            "Эх, сегодня удача не на вашей стороне!",
            "Неправильно! Слово остаётся загадкой..."
        ]
        wrong_letter_phrases = [
            "Увы, такой буквы нет!",
            "Ой-ой, этой буквы в слове не оказалось...",
            "Нет-нет, вы ошиблись буквой!",
            "Барабан крутится, а буква — мимо!",
            "Холодно! Этой буквы здесь нет!",
            f"Жаль, но в слове нет буквы {bukva}...",
            "Эх, пусто! Попробуйте другую букву!",
            f"Не угадали! Буква {bukva} не подошла.",
            "Фальстарт! Такой буквы в загадке нет.",
            "Мимо! Слово остаётся загадкой..."
        ]
        right_letter_phrases = [
            f"Есть такая буква! Открываем «{bukva}»!",
            f"Абсолютно верно! Буква «{bukva}» на месте!",
            f"Опа-на! Буква «{bukva}» принесла вам удачу!",
            f"Барабан ликует! Буква «{bukva}» в слове есть!",
            f"Да-да-да! Вот она — буква «{bukva}»!",
            f"Прямо в яблочко! Открывайте все «{bukva}»!",
            f"Великолепно! Буква «{bukva}» теперь на табло!",
            f"Так держать! Буква «{bukva}» — ваша!",
            f"Словно по волшебству! «{bukva}» на месте!",
            f"Игра пошла! Буква «{bukva}» открыта!"
        ]  # Фразы
        win_by_letters_phrases = [
            f"Вы собрали слово «{c}» по буквам! Поздравляем с победой!",
            f"Постепенно открывая буквы, вы верно составили слово «{c}».",
            f"Шаг за шагом вы пришли к правильному ответу - «{c}».",
            f"Методом исключения и подбора вы раскрыли слово «{c}».",
            f"Буква за буквой - и вот перед нами правильное слово «{c}».",
            f"Вы проявили терпение и собрали слово «{c}» целиком.",
            f"Анализируя каждую букву, вы вычислили загаданное слово - «{c}».",  # Фразы
            f"Ваша тактика угадывания букв привела вас к слову «{c}».",
            f"Открывая по одной букве, вы полностью восстановили слово «{c}».",
            f"Постепенно заполняя пробелы, вы составили слово «{c}»."
        ]
        print('1) Одиночный')
        print('2) Друг против друга (от 2 до 4 игроков)')
        print('3) Дуэль (1 игрок загадывает слово другой его угадывает)')
        vibor = int(input('Выберите режим: '))
        if vibor == 3:
            slovo = input('Введите слово (пожалуйста вводите существующие слова и без ошибок): ').lower()
            slovo = slova[random.randint(0, 2114)]
            bukvi = len(slovo)
            c = slovo
            slovo = list(slovo)
            izvestnie = ['_'] * bukvi
            win_phrases = [
                f"Правильно! Загаданное слово - «{c}»!",
                f"Верный ответ! Это действительно «{c}».",
                f"Поздравляем! Вы угадали слово «{c}».",
                f"Абсолютно верно! Это слово «{c}».",
                f"Так и есть! Перед нами слово «{c}».",
                f"Вы совершенно правы! Загаданное слово - «{c}».",
                f"Браво! Вы разгадали наше слово - «{c}».",
                f"Победа! Вы назвали правильное слово - «{c}».",
                f"Игра окончена! Правильный ответ - «{c}».",
                f"Молодец! Вы нашли нужное слово - «{c}»."
            ]
            ochki = 0
            odin()
        else:
            if vibor == 1:
                print('Приятной игры')
                time.sleep(2)
                ochki = 0
                odin()
            elif vibor == 2:
                batl = 1
                igroki = int(input('Введите количество игроков (от 2 до 4): '))
                if 2 <= igroki <= 4:
                    print('Приятной игры')
                    vibili = ['0'] * igroki
                    ochki = [0] * igroki
                    coop()
    except ValueError:
        print('Ошибка! Попробуйте ещё раз')

def odin():
    global igroki, ochki, ochko, ocherd, izvestnie, slovo, win_by_letters_phrases
    if izvestnie == slovo:
        print(win_by_letters_phrases)
        ochki += ochko
        pobeda()
    ochko = input('Пожалуйста нажмите <Enter> для прокрутки барабана!')
    ochko = 0
    koleso1()

def coop():
    global ochki, ochko, igroki, ocherd, win_by_letters_phrases, izvestnie, slovo, vibili, ocherd2, chislo, pobedil
    if izvestnie == slovo:
        print(win_by_letters_phrases)
        ochki[ocherd - 1] = ochko + int(ochki[ocherd - 1])
        pobedil = ocherd
        podshet()
    a = 0
    for i in range(igroki):
        if vibili[i - 1] == '1':
            a += 1
    if a == igroki:
        defeat()
    if ocherd < igroki and vibili[ocherd - 1] == '0':
        ocherd += 1
    elif ocherd == igroki and vibili[0] == '0':
        ocherd = 1
    else:
        while True:
            if igroki - a == 1:
                break
            if vibili[ocherd - 1] == '0' and ocherd != ocherd2:
                break
            if ocherd == igroki:
                ocherd = 1
            else:
                ocherd += 1
    ocherd2 = ocherd
    chislo = ocherd - 1
    print(f'Игрок {ocherd} ваш ход!')
    ochko = input('Пожалуйста нажмите <Enter> для прокрутки барабана!')
    koleso2()

def podshet():
    global ochki, igroki, pobedil
    a = 0
    b = 0
    c2 = 0
    d2 = 0
    pob = [''] * igroki
    ry = 0
    if igroki == 2:
        a, b = ochki
        int(a)
        int(b)
    if igroki == 3:
        a, b, c2 = ochki
        int(a)
        int(b)
        int(c2)
    if igroki == 4:
        a, b, c2, d2 = ochki
        int(a)
        int(b)
        int(c2)
        int(d2)
    pobeditel = max(ochki)
    if a == pobeditel:
        pob[0] = 1
        ry += 1
    if b == pobeditel:
        pob[1] = 1
        ry += 1
    if c2 == pobeditel:
        pob[2] = 1
        ry += 1
    if d2 == pobeditel:
        pob[3] = 1
        ry += 1
    pob.remove('')
    time.sleep(2)
    if len(pob) == igroki:
        print(f'Ничья! Все игроки набрали {pobeditel} очков!')
    if len(pob) == igroki - 1 and ry > 1:
        for i in range(igroki):
            if ochki[i] != pobeditel:
                n = i
                f = ochki[n]
        print(f'Все набрали {pobeditel} очков! Но {n} набрал {f} и проиграл!')
    if ry == 2 and igroki > 3:
        print(f'Половина игроков набрала {pobeditel} очков! Другая половина набрала меньше и они проиграли по очкам!')
    if len(pob) == igroki - 3 or ry == 1:
        print(f'И у нас есть единственный победитель по очкам он набрал {pobeditel} очков!')
    g = 0
    time.sleep(2)
    pobedili = [''] * ry
    for i in range(igroki):
        if int(ochki[i-1]) == pobeditel:
            pobedili[g] = f'{i}'
            g += 1
    txttt = ' и '.join(pobedili)
    if ry > 1:
        print(f'И победили по очкам игроки {txttt}! Поздравляю победителей!')
    else:
        print(f'И наш победитель по очкам игрок {txttt}! Поздравляю!')
    if ry == igroki or ry == igroki:
        print('Игроки не получает ничего! Но один может получить всё')
    else:
        time.sleep(2)
        print(f'Поздровляю с победой! На счет записано {pobeditel}р!')
    time.sleep(2)
    print('Ну а я приглашаю игрока собравшего слово, на СУПЕРИГРУ!!!')
    print(f'Игрок {pobedil} пожалуйста подойдите ко мне!')
    vibor()

def vibor():
    global ochki, batl
    while True:
        print(f'У вас {ochki[ocherd-1]} очков!')
        time.sleep(2)
        vibor6 = input('Хотите принять участие в супер игре? (да/нет): ')
        if vibor6.lower() == 'да':
            superigra()
            break
        elif vibor6.lower() == 'нет':
            print(f'Поздровляю с победой у вас {ochki} очков!')
            time.sleep(2)
            print(f'На ваш счет записано {ochki}р!')
            start()
        else:
            print('Ошибка! Пожалуйста попробуйте еще раз!')

def koleso2():
    global ochko, ochki
    vremes = 0.1
    r3 = random.randint(20, 25)
    for _ in range(r3):
        sector = sektora2[random.randint(0, 23)]
        time.sleep(vremes)
        r3 -= 1
        vremes = vremes * 1.1

        if sector == 'Очки':
            ochko = random.randint(2, 20) * 50
            print(ochko)
        else:
            print(sector)
    time.sleep(1.5)
    if sector == 'Очки':
        bukvacoop()

    if sector == 'Приз':
        print('Сектор приз на барабане!')
        vibor = input(f'Игрок {ocherd} выбирайте остаться в игре или забрать приз и покинуть игру (остаюсь/покидаю): ')
        if 'покидаю' in vibor.lower():
            priz()
        else:
            print(f'Это ваше решение! Продолжаем игру вместе с игроком {ocherd}!')
            time.sleep(6)
            print('\n' * 10)
            coop()
    if sector == 'х2':
        print('Поздравляю! Теперь у вас вдвое больше очков!')
        ochki[ocherd - 1] = int(ochki[ocherd - 1]) * 2
        print(f'А именно {ochki[ocherd - 1]} очков!')
        time.sleep(5)
        print('\n' * 10)
        coop()
    if sector == '+':
        time.sleep(0.5)
        print('\n' * 10)
        print(f'Игрок {ocherd}!')
        plus()
    if sector == '-→':
        print(f'Вы упускаете свой ход игрок {ocherd}!')
        perehod()
    if sector == 'Банкрот':
        print('Ой ой ой!')
        print(f'Какой ужасный сектор для вас игрок {ocherd}!')
        bankrot()

def koleso1():
    global ochko, ochki
    vremes = 0.1
    r3 = random.randint(20, 25)
    for _ in range(r3):
        sector = sektora[random.randint(0,23)]
        time.sleep(vremes)
        r3 -= 1
        vremes = vremes * 1.1

        if sector == 'Очки':
            ochko = random.randint(2, 20) * 50
            print(ochko)
        else:
            print(sector)
    time.sleep(1.5)
    if sector == 'Очки':
        ochko = random.randint(2, 20) * 50
        bukva()

    if sector == 'Приз':
        print('Сектор приз на барабане!')
        vibor = input('Выбирайте остаться в игре или забрать приз и покинуть игру (остаюсь/покидаю): ')
        if 'покидаю' in vibor.lower():
            priz()
        else:
            print('Это ваше решение! Продолжаем игру!')
            time.sleep(6)
            print('\n' * 10)
            odin()
    if sector == 'х2':
        print('Поздравляю! Теперь у вас вдвое больше очков!')
        ochki = ochki * 2
        print(f'А именно {ochki} очков!')
        time.sleep(5)
        print('\n' * 10)
        odin()
    if sector == '+':
        time.sleep(0.5)
        print('\n' * 10)
        plus()

def perehod():
    coop()

def bankrot():
    global ochki, ocherd
    bomj = int(ochki[ocherd - 1])
    if ocherd < igroki:
        ochki[ocherd] = int(ochki[ocherd]) + bomj
        ochki[ocherd - 1] = 0
        print(f'Теперь у игрока {ocherd + 1} на {bomj} больше!')
    else:
        ochki[0] = int(ochki[0]) + bomj
        ochki[ocherd - 1] = 0
        print(f'Теперь у игрока 1 на {bomj} очков больше!')
    coop()

def priz():
    global c, batl, vibili, ocherd
    prizes = [
        "Телевизор", "Холодильник", "Путешествие",
        "10 000 рублей", "Смартфон", "Кот в мешке"
    ]
    print('Крутите барабан призов!')
    for _ in range(random.randint(6,12)):
        prizzzz = prizes[random.randint(0,5)]
        print(prizzzz)
        time.sleep(1)
    print(f'Поздравляю ваш приз {prizzzz}!')
    print('Но я вынужден вас проводить к выходу')
    if batl:
        time.sleep(3)
        vibili[ocherd - 1] = '1'
        coop()
    else:
        print(f'А слово было {c}!')
        time.sleep(7)

def plus():
    global izvestnie, bukvi
    print('Сектор плюс на барабане!')
    while True:
        print(''.join(izvestnie))
        vibor = input(f'Выберите букву от 1 до {bukvi}: ')
        vibor = int(vibor)
        if 0 < vibor <= bukvi and izvestnie[vibor-1] == '_':
            otkrit = slovo[vibor-1]
            a = 0
            for n in range(bukvi):
                if otkrit == slovo[n-1]:
                    a += 1
                    izvestnie[n-1] = otkrit
            if a > 1:
                print(f'Целых {a} {otkrit} в этом слове!')
                print(''.join(izvestnie))
                time.sleep(5)
                print('\n' * 10)
                break
            else:
                print(f'И это единственая буква {otkrit} в этом слове!')
                print(''.join(izvestnie))
                time.sleep(5)
                print('\n' * 10)
                break
    if batl:
        coop()
    else:
        odin()

def bukva():
    global izvestnie, win_phrases, isp, ochko, ochki, d
    points_phrases1 = [
        f"Вы получаете {ochko} очков",
        f"На ваш счет начислено {ochko} очков",
        f"Ваш выигрыш в этом раунде - {ochko} очков",
        f"Барабан принес вам {ochko} очков",
        f"К вашей сумме добавлено {ochko} очков",
        f"Вы заработали {ochko} очков в этом ходе",
        f"Поздравляем с выигрышем {ochko} очков",
        f"Ваш приз - {ochko} очков",
        f"Текущий выигрыш составляет {ochko + int(ochki)} очков",
        f"В выигрыш добавлено: {ochko} очков"
    ]
    b = ''.join(izvestnie)
    print(b)
    print('Использованные буквы здесь: ',' '.join(isp))
    points_phrases = [
        f"Вы получаете {ochko} очков",
        f"На ваш счет начислено {ochko} очков",
        f"Ваш выигрыш в этом раунде - {ochko} очков",
        f"Барабан принес вам {ochko} очков",
        f"К вашей сумме добавлено {ochko} очков",
        f"Вы заработали {ochko} очков в этом ходе",
        f"Поздравляем с выигрышем {ochko} очков",
        f"Ваш приз - {ochko} очков",
        f"Текущий выигрыш составляет {ochko + ochki} очков",
        f"В выигрыш добавлено: {ochko} очков"
    ]
    a = 0
    bukva = input('Введите букву или рискните введя слово: ')
    ail_phrases = [
        "Увы, но это неверное слово!",
        "Ой, какая досада! Вы не угадали...",
        "Нет, к сожалению, это не оно!",
        "Барабан крутится, а слово — мимо!",
        "Не повезло... Попробуйте ещё раз!",
        "Холодно! Совсем не то слово!",
        "Жаль, но загаданное слово — другое...",
        "Вы близко, но это не победа!",
        "Эх, сегодня удача не на вашей стороне!",
        "Неправильно! Слово остаётся загадкой..."
    ]
    wrong_letter_phrases = [
        "Увы, такой буквы нет!",
        "Ой-ой, этой буквы в слове не оказалось...",
        "Нет-нет, вы ошиблись буквой!",
        "Барабан крутится, а буква — мимо!",
        "Холодно! Этой буквы здесь нет!",
        f"Жаль, но в слове нет буквы {bukva}...",
        "Эх, пусто! Попробуйте другую букву!",
        f"Не угадали! Буква {bukva} не подошла.",
        "Фальстарт! Такой буквы в загадке нет.",
        "Мимо! Слово остаётся загадкой..."
    ]
    fail_phrases = [
        "Увы, но это неверное слово!",
        "Ой, какая досада! Вы не угадали...",
        "Нет, к сожалению, это не оно!",
        "Барабан крутится, а слово — мимо!",
        "Не повезло... Попробуйте ещё раз!",
        "Холодно! Совсем не то слово!",
        "Жаль, но загаданное слово — другое...",
        "Вы близко, но это не победа!",
        "Эх, сегодня удача не на вашей стороне!",
        "Неправильно! Слово остаётся загадкой..."
    ]
    right_letter_phrases = [
        f"Есть такая буква! Открываем «{bukva}»!",
        f"Абсолютно верно! Буква «{bukva}» на месте!",
        f"Опа-на! Буква «{bukva}» принесла вам удачу!",
        f"Барабан ликует! Буква «{bukva}» в слове есть!",
        f"Да-да-да! Вот она — буква «{bukva}»!",
        f"Прямо в яблочко! Открывайте все «{bukva}»!",
        f"Великолепно! Буква «{bukva}» теперь на табло!",
        f"Так держать! Буква «{bukva}» — ваша!",
        f"Словно по волшебству! «{bukva}» на месте!",
        f"Игра пошла! Буква «{bukva}» открыта!"
    ]  # Фразы
    win_by_letters_phrases = [
        f"Вы собрали слово «{c}» по буквам! Поздравляем с победой!",
        f"Постепенно открывая буквы, вы верно составили слово «{c}».",
        f"Шаг за шагом вы пришли к правильному ответу - «{c}».",
        f"Методом исключения и подбора вы раскрыли слово «{c}».",
        f"Буква за буквой - и вот перед нами правильное слово «{c}».",
        f"Вы проявили терпение и собрали слово «{c}» целиком.",
        f"Анализируя каждую букву, вы вычислили загаданное слово - «{c}».",  # Фразы
        f"Ваша тактика угадывания букв привела вас к слову «{c}».",
        f"Открывая по одной букве, вы полностью восстановили слово «{c}».",
        f"Постепенно заполняя пробелы, вы составили слово «{c}»."
    ]
    points_phrases1 = [
        f"Вы получаете {ochko} очков",
        f"На ваш счет начислено {ochko} очков",
        f"Ваш выигрыш в этом раунде - {ochko} очков",
        f"Барабан принес вам {ochko} очков",
        f"К вашей сумме добавлено {ochko} очков",
        f"Вы заработали {ochko} очков в этом ходе",
        f"Поздравляем с выигрышем {ochko} очков",
        f"Ваш приз - {ochko} очков",
        f"Текущий выигрыш составляет {ochko + ochki} очков",
        f"В выигрыш добавлено: {ochko} очков"
    ]
    isp[d] = bukva
    d += 1
    if len(bukva) < 2:
        for i in range(bukvi):
            if bukva == slovo[i-1]:
                a += 1
                izvestnie[i-1] = bukva
        if a > 0:
            print(right_letter_phrases[random.randint(0,9)])
            ochki += ochko * a
            print(points_phrases[random.randint(0,9)])
            b = ''.join(izvestnie)
            print(b)
        else:
            print(wrong_letter_phrases[random.randint(0,9)])

    else:
        if bukva == c:
            print(win_phrases[random.randint(0,9)])
            ochko = ochko * 3
            ochki += ochko
            points_phrases1 = [
                f"Вы получаете {ochko} очков",
                f"На ваш счет начислено {ochko} очков",
                f"Ваш выигрыш в этом раунде - {ochko} очков",
                f"Барабан принес вам {ochko} очков",
                f"К вашей сумме добавлено {ochko} очков",
                f"Вы заработали {ochko} очков в этом ходе",
                f"Поздравляем с выигрышем {ochko} очков",
                f"Ваш приз - {ochko} очков",
                f"Текущий выигрыш составляет {ochko + ochki} очков",
                f"В выигрыш добавлено: {ochko} очков"
            ]
            print(points_phrases[random.randint(0,9)])
            pobeda()
        else:
            print(fail_phrases[random.randint(0,9)])
    print(f'У вас {ochki} очков!')
    odin()

def bukvacoop():
    global izvestnie, win_phrases, isp, ochko, ochki, d, ocherd, chislo, pobedil
    b = ''.join(izvestnie)
    print(b)
    print('Использованные буквы здесь: ',' '.join(isp))
    a = 0
    bukva = input(f'Игрок {ocherd} напишите букву или рискните введя слово: ')
    ail_phrases = [
        "Увы, но это неверное слово!",
        "Ой, какая досада! Вы не угадали...",
        "Нет, к сожалению, это не оно!",
        "Барабан крутится, а слово — мимо!",
        "Не повезло... Попробуйте ещё раз!",
        "Холодно! Совсем не то слово!",
        "Жаль, но загаданное слово — другое...",
        "Вы близко, но это не победа!",
        "Эх, сегодня удача не на вашей стороне!",
        "Неправильно! Слово остаётся загадкой..."
    ]
    wrong_letter_phrases = [
        "Увы, такой буквы нет!",
        "Ой-ой, этой буквы в слове не оказалось...",
        "Нет-нет, вы ошиблись буквой!",
        "Барабан крутится, а буква — мимо!",
        "Холодно! Этой буквы здесь нет!",
        f"Жаль, но в слове нет буквы {bukva}...",
        "Эх, пусто! Попробуйте другую букву в следующий раз!",
        f"Не угадали! Буква {bukva} не подошла.",
        "Фальстарт! Такой буквы в загадке нет.",
        "Мимо! Слово остаётся загадкой..."
    ]
    fail_phrases = [
        "Увы, но это неверное слово!",
        "Ой, какая досада! Вы не угадали...",
        "Нет, к сожалению, это не оно!",
        "Барабан крутится, а слово — мимо!",
        "Не повезло... Попробуйте ещё раз!",
        "Холодно! Совсем не то слово!",
        "Жаль, но загаданное слово — другое...",
        "Вы близко, но это не победа!",
        "Эх, сегодня удача не на вашей стороне!",
        "Неправильно! Слово остаётся загадкой..."
    ]
    right_letter_phrases = [
        f"Есть такая буква! Открываем «{bukva}»!",
        f"Абсолютно верно! Буква «{bukva}» на месте!",
        f"Опа-на! Буква «{bukva}» принесла вам удачу!",
        f"Барабан ликует! Буква «{bukva}» в слове есть!",
        f"Да-да-да! Вот она — буква «{bukva}»!",
        f"Прямо в яблочко! Открывайте все «{bukva}»!",
        f"Великолепно! Буква «{bukva}» теперь на табло!",
        f"Так держать! Буква «{bukva}» — ваша!",
        f"Словно по волшебству! «{bukva}» на месте!",
        f"Игра пошла! Буква «{bukva}» открыта!"
    ]  # Фразы
    win_by_letters_phrases = [
        f"Вы собрали слово «{c}» по буквам! Поздравляем с победой!",
        f"Постепенно открывая буквы, вы верно составили слово «{c}».",
        f"Шаг за шагом вы пришли к правильному ответу - «{c}».",
        f"Методом исключения и подбора вы раскрыли слово «{c}».",
        f"Буква за буквой - и вот перед нами правильное слово «{c}».",
        f"Вы проявили терпение и собрали слово «{c}» целиком.",
        f"Анализируя каждую букву, вы вычислили загаданное слово - «{c}».",  # Фразы
        f"Ваша тактика угадывания букв привела вас к слову «{c}».",
        f"Открывая по одной букве, вы полностью восстановили слово «{c}».",
        f"Постепенно заполняя пробелы, вы составили слово «{c}»."
    ]
    points_phrases = [
        f"Вы получаете {ochko} очков!",
        f"На ваш счет начислено {ochko} очков!",
        f"Ваш выигрыш в этом раунде - {ochko} очков!",
        f"Барабан принес вам {ochko} очков!",
        f"К вашей сумме добавлено {ochko} очков!",
        f"Вы заработали {ochko} очков в этом ходе!",
        f"Поздравляем с выигрышем {ochko} очков!",
        f"Ваш приз - {ochko} очков!",
        f"Целых {ochko} очков! Поздравляю!",
        f"В выигрыш добавлено: {ochko} очков!"
    ]
    isp[d] = bukva
    d += 1
    if len(bukva) < 2:
        for i in range(bukvi):
            if bukva == slovo[i-1]:
                a += 1
                izvestnie[i-1] = bukva
        if a > 0:
            print(right_letter_phrases[random.randint(0,9)])
            ochki[ocherd - 1] = int(ochki[ocherd - 1]) + ochko
            print(f'Игрок {ocherd}!')
            print(points_phrases[random.randint(0,9)])
            b = ''.join(izvestnie)
            print(b)
        else:
            print(wrong_letter_phrases[random.randint(0,9)])
    else:
        if bukva == c:
            print(win_phrases[random.randint(0,9)])
            ochko = ochko * 3
            points_phrases1 = [
                f"Вы получаете {ochko} очков",
                f"На ваш счет начислено {ochko} очков",
                f"Ваш выигрыш в этом раунде - {ochko} очков",
                f"Барабан принес вам {ochko} очков",
                f"К вашей сумме добавлено {ochko} очков",
                f"Вы заработали {ochko} очков в этом ходе",
                f"Поздравляем с выигрышем {ochko} очков",
                f"Ваш приз - {ochko} очков",
                f"Текущий выигрыш составляет {ochko + int(ochki[ocherd - 1])} очков",
                f"В выигрыш добавлено: {ochko} очков"
            ]
            ochki[ocherd - 1] = int(ochki[ocherd - 1]) + ochko
            print(f'Игрок {ocherd}!')
            print(points_phrases[random.randint(0,9)])
            print(f'Ваш новый счет {ochki[ocherd - 1]}')
            pobedil = ocherd
            podshet()
        else:
            print(fail_phrases[random.randint(0,9)])
    pr = int(ochki[ocherd - 1])
    print(f'Игрок {ocherd} у вас {pr} очков!')
    coop()

def pobeda():
    global ochki, batl, vibor5
    while True:
        print(f'У вас {ochki} очков!')
        vibor5 = input('Хотите принять участие в супер игре? (да/нет): ')
        if vibor5.lower() == 'да':
            superigra()
            break
        elif vibor5.lower() == 'нет':
            print(f'Поздровляю с победой у вас {ochki} очков!')
            print(f'На ваш счет записано {ochki}р!')
            start()
        else:
            print('Ошибка! Пожалуйста попробуйте еще раз!')

def superigra():
    global slovo2
    slovo2 = [superslova[random.randint(0, len(superslova)) - 1]]
    slovo2 = ''.join(slovo2)
    superigra2()

def superigra2():
    global slovo2, ochki, ocherd, pobedil
    s1, s2, s3, s4, s5 = ['_'] * 5
    bukvi = len(slovo2)
    c = slovo2
    izvestnie = ['_'] * 5
    slovo2 = list(slovo2)
    print('Правила простые! Вы должны угадать буквы! 3 буквы - бытовой приз! 4 буквы - электроника в призе! 5 букв/слово - супер приз!')
    if batl:
        print(f'Игрок {pobedil}!')
    vibor = input('Напишите 5 букв! Делайте выбор с умом (все буквы вводите СЛИТНО БЕЗ ПРОБЕЛОВ И ЗАПЯТЫХ!!!): ')
    s1, s2, s3, s4, s5 = vibor
    n = 0
    prize_phrases = {
        "appliances": [
            "Поздравляем! Вы выиграли стиральную машину!",
            "Ваш приз — новейший холодильник!",
            "Теперь у вас будет идеальный кофе — выиграна кофемашина!",
            "Вы стали обладателем мощного пылесоса!",
            "В вашей кухне появится мультиварка!"
        ],
        "electronics": [
            "Ваш приз — смартфон последней модели!",
            "Теперь у вас будет домашний кинотеатр — выиграли телевизор!",
            "Музыка будет звучать четче — беспроводные наушники ваши!",
            "Новый ноутбук для работы и развлечений!"
        ],
        "trips": [
            "путешествие на двоих!",
            "отдых на курорте",
            "АВТОМОБИЛЬ!"
        ],
        "funny": [
            "Это не просто приз — это мечта!",
            "Вы — настоящий победитель!",
            "Сегодня ваш счастливый день!"
        ]
    }
    priz3 = "appliances"
    priz1 = "electronics"
    superpriz = "trips"
    rofl = "funny"
    super_game_phrases = {
        0: [
            "Увы, ни одной буквы не угадано",
            "Пока не получилось, попробуйте ещё!",
            "Нужно быть внимательнее - буквы не найдены"
        ],
        1: [
            "Ужасно! Угадана 1 буква!",
            "Единственная буква открыта! Так держать!",
            "1 из 5 - это начало победы!"
        ],
        2: [
            "Отлично! Две буквы на месте!",
            "Всего 2 правильные буквы! К сожалению это проигрыш!",
            "Почти половина букв собрана - 2 буквы угаданы! Но сегодня вы без призов"
        ],
        3: [
            "Прекрасно! Три верные буквы!",
            "Больше половины! 3 правильные буквы",
            "Целых 3 из 5 - вы выиграли приз!"
        ],
        4: [
            f"Почти победа! 4 правильные буквы! Ваш приз {random.choice(prize_phrases[priz1]).lower()}!",
            f"Чуть-чуть не хватило! 4 из 5 букв! Вы выиграли {random.choice(prize_phrases[priz1]).lower()}!",
            f"Фантастика! 4 буквы угаданы верно! {random.choice(prize_phrases[priz1])} вот ваш приз!"
        ],
        5: [
            "АБСОЛЮТНАЯ ПОБЕДА! Все 5 букв!",
            "ИДЕАЛЬНО! Вы угадали все буквы!",
            "ВОТ ЭТО ДА! 5 из 5 - вы гений!"
        ]
    }

    for i in range(bukvi):
        if slovo2[i-1] == s1.lower():
            n += 1
            izvestnie[i-1] = s1.lower()
    for i in range(bukvi):
        if slovo2[i - 1] == s2.lower():
            n += 1
            izvestnie[i - 1] = s2.lower()
    for i in range(bukvi):
        if slovo2[i - 1] == s3.lower():
            n += 1
            izvestnie[i - 1] = s3.lower()
    for i in range(bukvi):
        if slovo2[i - 1] == s4.lower():
            n += 1
            izvestnie[i - 1] = s4.lower()
    for i in range(bukvi):
        if slovo2[i - 1] == s5.lower():
            n += 1
            izvestnie[i - 1] = s5.lower()
    izvestnie = ''.join(izvestnie)

    print(f'Слово было {c}!')
    print(f'Ваш вариант {izvestnie}!')

    correct = len(izvestnie.replace('_', ''))
    print(correct)
    if correct == 0:
        print(random.choice(super_game_phrases[0]))
        print('Вам доступен утешительный приз! А именно:')
        time.sleep(1.5)
        print('НИЧЕГО!!!')
    elif correct == 1:
        print(random.choice(super_game_phrases[1]))
        print('Я дарю вам приз! Мой респект за то что вы сыграли в супер игру и ПРОИГРАЛИ!!!')
    elif correct == 2:
        print(random.choice(super_game_phrases[2]))
        print('От всего сердца ваш утешительный приз! 100 рублей!!!')
    elif correct == 3:
        print(random.choice(super_game_phrases[3]))
        print(f'На сегодня ваш приз это {random.choice(prize_phrases[priz3])}!!!')
        print(f'Из-за того что вы выиграли все ваши очки превращаются в рубли! Эта сумма в виде {ochki} рублей теперь ваша!!! ')
    elif correct == 4:
        print(random.choice(super_game_phrases[4]))
        print(f'Из-за того что вы выиграли все ваши очки превращаются в рубли! Эта сумма в виде {ochki} рублей теперь ваша!!! ')
    elif correct == 5:
        print(random.choice(super_game_phrases[5]))
        print(f'Вы собрали абсолютно все буквы! Ваш заслуженный приз это {random.choice(prize_phrases[superpriz])}!!!')
        print(f'Из-за того что вы выиграли все ваши очки превращаются в рубли! Эта сумма в виде {ochki} рублей теперь ваша!!! ')
    start()

def start():
    while True:
        vibor = input('Готовы начинать? ')
        if 'да' in vibor.lower():
            nachalo()
        elif 'не' in vibor.lower():
            print('Выключение...')
            break
        elif '3476' in vibor.lower():
            pobeda()
        else:
            print('Ошибка! Попробуйте ещё раз!')

def defeat():
    print('Все игроки выбыли игра окончена.')
    start()

start()