import random
import time

while True:
    hz = input('Хотите сыграть?')
    if hz.lower() == 'да':
        batl = 0
        slova = [
            "год", "человек", "время", "дело", "жизнь", "день", "рука", "работа", "слово", "место",
            "вопрос", "лицо", "глаз", "страна", "друг", "сторона", "дом", "случай", "ребенок", "голова",
            "система", "вид", "конец", "отношение", "город", "часть", "женщина", "проблема", "земля", "решение",
            "власть", "машина", "закон", "час", "образ", "отец", "история", "нога", "вода", "война",
            "возможность", "компания", "результат", "дверь", "бог", "народ", "область", "число", "голос", "развитие",
            "группа", "жена", "процесс", "условие", "книга", "ночь", "суд", "деньга", "уровень", "начало",
            "государство", "стол", "средство", "связь", "имя", "президент", "форма", "путь", "организация", "качество",
            "действие", "статья", "общество", "ситуация", "деятельность", "школа", "душа", "дорога", "язык", "взгляд",
            "момент", "минута", "месяц", "порядок", "цель", "программа", "муж", "помощь", "мысль", "вечер",
            "орган", "правительство", "рынок", "предприятие", "партия", "роль", "смысл", "мама", "мера", "улица",
            "состояние", "задача", "информация", "театр", "внимание", "производство", "квартира", "труд", "тело",
            "письмо",
            "центр", "утро", "мать", "комната", "семья", "сын", "смерть", "положение", "интерес", "федерация",
            "век", "идея", "управление", "автор", "окно", "ответ", "совет", "разговор", "мужчина", "ряд",
            "счет", "мнение", "цена", "точка", "план", "проект", "глава", "материал", "основа", "причина",
            "движение", "культура", "сердце", "рубль", "наука", "документ", "неделя", "вещь", "чувство", "правило",
            "служба", "газета", "срок", "институт", "член", "ход", "стена", "директор", "плечо", "опыт",
            "встреча", "принцип", "событие", "структура", "количество", "товарищ", "создание", "значение", "объект",
            "гражданин",
            "очередь", "период", "образование", "состав", "пример", "лес", "исследование", "девушка", "данные", "палец",
            "судьба", "тип", "метод", "политика", "армия", "брат", "представитель", "борьба", "использование", "шаг",
            "игра", "участие", "территория", "край", "размер", "номер", "район", "население", "банк", "начальник",
            "класс", "зал", "изменение", "большинство", "характер", "кровь", "направление", "позиция", "герой",
            "течение",
            "девочка", "искусство", "гость", "воздух", "мальчик", "фильм", "договор", "регион", "выбор", "свобода",
            "врач", "экономика", "небо", "факт", "церковь", "завод", "фирма", "бизнес", "союз", "деньги",
            "специалист", "род", "команда", "руководитель", "спина", "дух", "музыка", "способ", "хозяин", "поле",
            "доллар", "память", "природа", "дерево", "оценка", "объем", "картина", "процент", "требование", "писатель",
            "сцена", "анализ", "основание", "повод", "вариант", "берег", "модель", "степень", "самолет", "телефон",
            "граница", "песня", "половина", "министр", "угол", "зрение", "предмет", "литература", "операция", "двор",
            "спектакль", "руководство", "солнце", "автомобиль", "родитель", "участник", "журнал", "база",
            "пространство", "защита",
            "название", "стих", "ум", "море", "удар", "знание", "солдат", "миллион", "строительство", "технология",
            "председатель", "сон", "сознание", "бумага", "реформа", "оружие", "линия", "текст", "выход", "ребята",
            "магазин", "соответствие", "участок", "услуга", "поэт", "предложение", "желание", "пара", "успех", "среда",
            "возраст", "комплекс", "бюджет", "представление", "площадь", "генерал", "господин", "дочь", "понятие",
            "кабинет",
            "безопасность", "фонд", "сфера", "папа", "сотрудник", "продукция", "будущее", "продукт", "содержание",
            "художник",
            "республика", "сумма", "контроль", "парень", "ветер", "хозяйство", "помочь", "курс", "губа", "река",
            "грудь", "огонь", "нос", "волос", "ухо", "отсутствие", "радость", "сад", "подготовка", "необходимость",
            "доктор", "лето", "камень", "здание", "капитан", "собака", "итог", "рис", "техника", "элемент",
            "источник", "деревня", "депутат", "проведение", "рот", "масса", "комиссия", "цвет", "рассказ", "функция",
            "определение", "мужик", "обеспечение", "обстоятельство", "работник", "разработка", "лист", "звезда", "гора",
            "применение",
            "победа", "товар", "воля", "зона", "предел", "целое", "личность", "офицер", "влияние", "поддержка",
            "ответственность", "цветок", "праздник", "немец", "бой", "сестра", "господь", "учитель", "многое", "рамка",
            "практика", "показатель", "метр", "войско", "частность", "особенность", "снег", "комитет", "налог", "акт",
            "отдел", "карман", "вывод", "норма", "читатель", "этап", "сравнение", "прошлое", "фамилия", "кухня",
            "заявление", "доля", "пункт", "студент", "учет", "впечатление", "доход", "вирус", "клетка", "удовольствие",
            "теория", "враг", "собрание", "бутылка", "расчет", "го", "режим", "множество", "клуб", "попытка",
            "зуб", "сеть", "семь", "министерство", "прием", "боль", "сожаление", "кожа", "субъект", "знак",
            "актер", "ресурс", "акция", "газ", "журналист", "звук", "передача", "здоровье", "администрация", "болезнь",
            "детство", "мастер", "выборы", "зима", "подход", "поиск", "механизм", "выражение", "скорость", "ощущение",
            "стоимость", "коридор", "ошибка", "лидер", "карта", "заседание", "глубина", "хлеб", "поверхность",
            "энергия",
            "нарушение", "реализация", "революция", "поведение", "профессор", "исполнение", "заместитель", "суть",
            "станция", "реакция",
            "десяток", "столица", "формирование", "поколение", "дума", "существование", "продажа", "список",
            "способность", "противник",
            "схема", "долг", "режиссер", "отличие", "колено", "дед", "свойство", "этаж", "секунда", "фактор",
            "житель", "явление", "высота", "сосед", "усилие", "рождение", "расход", "остров", "фигура", "наличие",
            "дядя", "милиция", "растение", "существо", "черт", "бабушка", "законодательство", "собственность",
            "отрасль", "слеза",
            "волна", "стекло", "традиция", "январь", "оборудование", "зависимость", "фраза", "декабрь", "сведение",
            "трубка",
            "сентябрь", "университет", "командир", "храм", "повышение", "стиль", "артист", "больница", "одежда",
            "охрана",
            "водка", "кодекс", "имущество", "птица", "переход", "красота", "клиент", "толпа", "адрес", "отделение",
            "октябрь", "чудо", "счастие", "улыбка", "ужас", "аппарат", "корабль", "родина", "животное", "черта",
            "известие", "понимание", "тень", "апрель", "коллега", "преступление", "рыба", "кресло", "запах", "выставка",
            "князь", "фотография", "весна", "помещение", "эпоха", "занятие", "произведение", "концерт", "ладонь",
            "дама",
            "сомнение", "американец", "середина", "зарплата", "тайна", "запад", "июнь", "беседа", "фронт", "поезд",
            "должность", "баба", "промышленность", "музей", "судья", "получение", "полковник", "зритель", "секретарь",
            "установка",
            "поток", "ценность", "образец", "страница", "перспектива", "трава", "чиновник", "мозг", "сотня", "лагерь",
            "выступление", "оборона", "постановление", "честь", "настроение", "кровать", "характеристика",
            "обязанность", "шея", "крыша",
            "появление", "учреждение", "признак", "труба", "жертва", "беда", "фон", "организм", "ученик", "заключение",
            "выполнение", "канал", "исключение", "дача", "соглашение", "осень", "польза", "стул", "июль", "дождь",
            "сутки", "еврей", "конкурс", "открытие", "телевизор", "лошадь", "температура", "приказ", "лестница",
            "реклама",
            "спор", "подруга", "угроза", "конфликт", "изучение", "вино", "концепция", "достижение", "сообщение",
            "объединение",
            "обстановка", "костюм", "ключ", "ресторан", "назначение", "царь", "воспоминание", "увеличение", "вкус",
            "мероприятие",
            "лоб", "слой", "восток", "последствие", "принятие", "сотрудничество", "нефть", "слух", "бок", "переговоры",
            "тюрьма", "кандидат", "просьба", "реальность", "подарок", "категория", "потребность", "быль", "редакция",
            "очко",
            "километр", "губернатор", "новость", "инструмент", "потеря", "взаимодействие", "звонок", "кусок", "капитал",
            "грех",
            "перевод", "партнер", "ноябрь", "молодежь", "тишина", "творчество", "книжка", "мясо", "масло", "деталь",
            "инженер", "оплата", "эксперт", "кремль", "февраль", "следствие", "пьеса", "билет", "урок", "коллектив",
            "устройство", "палата", "площадка", "опасность", "пропасть", "воздействие", "разница", "родственник",
            "сезон", "издание",
            "человечество", "снижение", "запас", "крик", "публика", "вещество", "экран", "эффект", "ящик", "ракета",
            "водитель", "пакет", "зеркало", "вес", "дно", "вагон", "убийство", "тон", "щека", "дурак",
            "длина", "давление", "двигатель", "камера", "обращение", "формула", "запись", "крыло", "поездка",
            "гостиница",
            "колесо", "разрешение", "торговля", "академия", "доклад", "общение", "присутствие", "процедура",
            "испытание", "нож",
            "проверка", "коммунист", "цифра", "полет", "стакан", "эффективность", "обучение", "портрет", "достоинство",
            "рассмотрение",
            "владелец", "жилье", "компьютер", "корень", "смена", "доказательство", "кадр", "лейтенант", "признание",
            "темнота",
            "пистолет", "наблюдение", "мост", "ремонт", "истина", "вход", "политик", "живот", "кредит", "шум",
            "обед", "недостаток", "памятник", "вершина", "серия", "эксперимент", "сущность", "транспорт", "инициатива",
            "активность",
            "конференция", "кулак", "доска", "ожидание", "платье", "смех", "отказ", "сбор", "пенсия", "буква",
            "порог", "автобус", "воспитание", "производитель", "полоса", "риск", "пиво", "корпус", "штаб", "кольцо",
            "постель", "выпуск", "дворец", "брак", "прокурор", "печать", "окончание", "автомат", "тенденция",
            "следователь",
            "штат", "куст", "старуха", "описание", "психология", "шутка", "съезд", "ставка", "забота", "величина",
            "версия", "мешок", "конструкция", "контакт", "шанс", "лодка", "редактор", "заказ", "кофе", "рубеж",
            "статус", "спорт", "покой", "кризис", "взрыв", "профессия", "дым", "металл", "сапог", "диван",
            "интернет", "почва", "лед", "подразделение", "минимум", "конь", "дружба", "вина", "замок", "мечта",
            "сигнал", "талант", "мгновение", "столик", "затрата", "золото", "миг", "плата", "подъезд", "масштаб",
            "обсуждение", "сделка", "обязательство", "расстояние", "отдых", "телевидение", "тетя", "яблоко",
            "свидетель", "монастырь",
            "чтение", "параметр", "кампания", "помощник", "полк", "мощность", "сюжет", "потолок", "регистрация",
            "майор",
            "эксплуатация", "озеро", "новое", "атмосфера", "премия", "совесть", "предприниматель", "мальчишка", "дочка",
            "приятель",
            "начальство", "препарат", "село", "обработка", "танк", "милиционер", "ручка", "возвращение", "прокуратура",
            "ворота",
            "молоко", "еда", "сказка", "краска", "хвост", "сигарета", "введение", "покупатель", "поворот", "москвич",
            "ограничение", "инвестиция", "нация", "набор", "поселок", "дыхание", "адвокат", "сумка", "пресса",
            "корреспондент",
            "песок", "удивление", "потребитель", "указание", "изображение", "счастье", "мэр", "согласие",
            "действительность", "планета",
            "агентство", "танец", "библиотека", "финансирование", "объяснение", "распределение", "конституция",
            "таблица", "поэзия", "термин",
            "прибыль", "стандарт", "восторг", "гибель", "изделие", "темп", "вооружение", "осуществление", "уход",
            "чемпионат",
            "молитва", "контракт", "философия", "горло", "оборот", "кость", "ведомство", "преимущество", "мина",
            "полномочие"
        ]       # 1000 Слов
        r = random.randint(0, 999)
        vibor = input('Вы будите играть один? Друг с другом или друг загадывает?')          # Выбор режима игры
        if vibor.lower() == 'один' or vibor.lower() == 'да' or vibor == '1':
            slovo = slova[r]
        elif 'загадывает' in vibor.lower():
            slovo = input('введите слово: ').lower()
        elif 'против' in vibor.lower() or 'с другом' in vibor:
            batl = 1
            slovo = slova[r]
        bukvi = len(slovo)
        c = ''.join(slovo)      # Подготовка игры
        slovo = list(slovo)
        izvestnie = ['_'] * bukvi
        a = ''.join(izvestnie)
        print('\n')
        print('\n')
        print('\n')
        print('\n')
        print('\n')
        print('\n')
        print('\n')
        print('\n')
        print('\n')
        print(bukvi * '_')
        popit = 6
        n = 0
        n2 = 0
        b = 0
        spisok = [''] * 33      # Подготовка игры
        ochki1 = 0
        ochki2 = 0
        ocherd = 1
        bukva = 'о'

        while True:
            fail_phrases = [
                "Увы, но это неверное слово!",
                "Ой, какая досада! Вы не угадали...",
                "Нет, к сожалению, это не оно!",
                "Барабан крутится, а слово — мимо!",
                "Не повезло... Попробуйте ещё раз!",
                "Холодно! Совсем не то слово!",
                "Жаль, но загаданное слово — другое...",
                "Вы близко, но это не победа!",
                "Эх, сегодня удача не на вашей стороне!",
                "Неправильно! Слово остаётся загадкой..."
            ]
            wrong_letter_phrases = [
                "Увы, такой буквы нет!",
                "Ой-ой, этой буквы в слове не оказалось...",
                "Нет-нет, вы ошиблись буквой!",
                "Барабан крутится, а буква — мимо!",
                "Холодно! Этой буквы здесь нет!",
                f"Жаль, но в слове нет буквы {bukva}...",
                "Эх, пусто! Попробуйте другую букву!",
                f"Не угадали! Буква {bukva} не подошла.",
                "Фальстарт! Такой буквы в загадке нет.",
                "Мимо! Слово остаётся загадкой..."
            ]
            right_letter_phrases = [
                f"Есть такая буква! Открываем «{bukva}»!",
                f"Абсолютно верно! Буква «{bukva}» на месте!",
                f"Опа-на! Буква «{bukva}» принесла вам удачу!",
                f"Барабан ликует! Буква «{bukva}» в слове есть!",
                f"Да-да-да! Вот она — буква «{bukva}»!",
                f"Прямо в яблочко! Открывайте все «{bukva}»!",
                f"Великолепно! Буква «{bukva}» теперь на табло!",
                f"Так держать! Буква «{bukva}» — ваша!",
                f"Словно по волшебству! «{bukva}» на месте!",
                f"Игра пошла! Буква «{bukva}» открыта!"
            ]
            win_phrases = [
                f"Правильно! Загаданное слово - «{c}»!",
                f"Верный ответ! Это действительно «{c}».",
                f"Поздравляем! Вы угадали слово «{c}».",
                f"Абсолютно верно! Это слово «{c}».",
                f"Так и есть! Перед нами слово «{c}».",
                f"Вы совершенно правы! Загаданное слово - «{c}».",
                f"Браво! Вы разгадали наше слово - «{c}».",
                f"Победа! Вы назвали правильное слово - «{c}».",
                f"Игра окончена! Правильный ответ - «{c}».",
                f"Молодец! Вы нашли нужное слово - «{c}»."
            ]
            win_by_letters_phrases = [
                f"Вы собрали слово «{c}» по буквам! Поздравляем с победой!",
                f"Постепенно открывая буквы, вы верно составили слово «{c}».",
                f"Шаг за шагом вы пришли к правильному ответу - «{c}».",
                f"Методом исключения и подбора вы раскрыли слово «{c}».",
                f"Буква за буквой - и вот перед нами правильное слово «{c}».",
                f"Вы проявили терпение и собрали слово «{c}» целиком.",
                f"Анализируя каждую букву, вы вычислили загаданное слово - «{c}».",     # Фразы
                f"Ваша тактика угадывания букв привела вас к слову «{c}».",
                f"Открывая по одной букве, вы полностью восстановили слово «{c}».",
                f"Постепенно заполняя пробелы, вы составили слово «{c}»."
            ]
            lose_phrases = [
                f"К сожалению, попытки закончились. Загаданное слово было «{c}».",
                f"Вы исчерпали все попытки. Правильный ответ - «{c}».",
                f"Игра завершена. Вы не угадали слово «{c}».",
                f"Попытки подошли к концу. Было загадано слово «{c}».",
                f"Вы не смогли угадать слово «{c}» за отведённые попытки.",
                f"Жаль, но вы не назвали верное слово «{c}» в нужное время.",
                f"Барабан остановился. Загаданное слово - «{c}».",
                f"Ваши попытки закончились. Словом было «{c}».",
                f"Вы приближались, но не назвали слово «{c}» вовремя.",
                f"Игра окончена. Вы не собрали слово «{c}» из букв."
            ]
            times = 0.1
            barobus = input('Нажмите <Enter> на клавиатуре как будите готовы')
            print('Крутите барабан!')
            for _ in range(random.randint(10,15)):
                baraban = 100 * random.randint(1, 15) # Барабан очков
                print(baraban)
                time.sleep(times)
                times += 0.1
            r2 = random.randint(0, 9)
            if popit < 1:
                print(lose_phrases[r2]) # Проверка попыток
                break
            print(a)
            if batl:
                bukva = input(f'Введите букву или слово игрок номер {ocherd}:').lower() # Ввод буквы
            else:
                bukva = input('Введите букву или слово: ').lower()

            if len(bukva) == 1:
                for _ in range(bukvi):
                    if bukva == slovo[n]:
                        r2 = random.randint(0,9) # Проверка наличия буквы
                        print(right_letter_phrases[r2])
                        izvestnie[n] = bukva
                        b = 1
                        if batl:
                            if ocherd == 1:
                                ochki1 += baraban
                            else:
                                ochki2 += baraban       # Выдача очков
                        else:
                            ochki1 += baraban
                    n += 1
            else:
                if bukva == c:
                    print(win_phrases[r2])
                    if batl:
                        if ocherd == 1:
                            ochki1 += baraban   # Проверка <Угадал ли игрок слово>
                        else:
                            ochki2 += baraban
                    else:
                        ochki1 += baraban
                    break
                else:
                    print(fail_phrases[r2])

            if b == 0:
                if batl:
                    print(wrong_letter_phrases[r2])     # Проверка на ошибку игрока <Если не угадал букву на попытку меньше>
                else:
                    popit -= 1
                    print(wrong_letter_phrases[r2])
                    print(f'Попыток: {popit}')
            if izvestnie == slovo:
                print(win_by_letters_phrases[r2])       # Проверка <Не сложил ли игрок слово бо буквам>
                if batl:
                    if ocherd == 1:
                        ochki1 += baraban
                    else:
                        ochki2 += baraban
                else:
                    ochki1 += baraban
                break
            a = ''.join(izvestnie)

            b = 0
            n = 0
            spisok[n2] = bukva              # Вывод использованых букв
            d = ' '.join(spisok)
            print('Вы использовали буквы ', d)
            n2 += 1
            if ocherd == 2:
                ocherd = 1      # Смена хода игроков в батле
            else:
                ocherd = 2
    else:
        print('Ну лан')
        break
    if batl and ochki1 > ochki2:
        print(f'1 игрок набрал {ochki1} а второй {ochki2}, победил первый игрок! Поздравляю с победой!')        # Подсчет очков и выявление победителя
    elif batl and ochki1 == ochki2:
        print(f'1 игрок набрал {ochki1} а второй {ochki2}, победила дружба!')
    elif batl and ochki2 > ochki1:
        print(f'1 игрок набрал {ochki1} а второй {ochki2}, победил второй игрок! Поздравляю с победой!')
    else:
        print(f'Вы набрали {ochki1} очков! Поздравляю!')